Catalogs/урскСтруктурыСети.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.14">
	<Catalog>
		<Properties>
			<Name>урскСтруктурыСети</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидОбъектаСтруктуры</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыОбъектовСтруктуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОрганизационногоОбъекта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.урскВидыОрганизационныхОбъектов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидТехническогоМеста</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.урскВидТехническихМест</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>СтатическиеПараметры</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Параметр</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.Параметры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.Значение</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Enums/урскВидыОбъектовСтруктуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.14">
	<Enum>
		<Properties>
			<Name>урскВидыОбъектовСтруктуры</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ОрганизационныйОбъект</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КомплексныйОбъект</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТехническоеМесто</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/урскСтруктурыСети/Forms/ФормаЭлемента/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Объект.ВидОбъектаСтруктуры = Перечисления.урскВидыОбъектовСтруктуры.ОрганизационныйОбъект Тогда
		ЭтаФорма.Заголовок = "Организационный объект";
		Элементы.ВидОрганизационногоОбъекта.Видимость = Истина;
		Элементы.ВидТехническогоМеста.Видимость = Ложь;  
	ИначеЕсли Объект.ВидОбъектаСтруктуры = Перечисления.урскВидыОбъектовСтруктуры.КомплексныйОбъект Тогда
		ЭтаФорма.Заголовок = "Комплексный объект";
		Элементы.ВидОрганизационногоОбъекта.Видимость = Истина;
		Элементы.ВидТехническогоМеста.Видимость = Ложь;
	ИначеЕсли Объект.ВидОбъектаСтруктуры = Перечисления.урскВидыОбъектовСтруктуры.ТехническоеМесто Тогда 
		ЭтаФорма.Заголовок = "Техническое место";
		Элементы.ВидОрганизационногоОбъекта.Видимость =  Ложь;
		Элементы.ВидТехническогоМеста.Видимость = Истина;
	КонецЕсли;
	
КонецПроцедуры


&НаСервере
Процедура ВидОбъектаСтруктурыПриИзмененииНаСервере()
	Если Объект.ВидОбъектаСтруктуры = Перечисления.урскВидыОбъектовСтруктуры.ОрганизационныйОбъект Тогда
		ЭтаФорма.Заголовок = "Организационный объект";
		Элементы.ВидОрганизационногоОбъекта.Видимость = Истина;
		Элементы.ВидТехническогоМеста.Видимость = Ложь;  
	ИначеЕсли Объект.ВидОбъектаСтруктуры = Перечисления.урскВидыОбъектовСтруктуры.КомплексныйОбъект Тогда
		ЭтаФорма.Заголовок = "Комплексный объект";
		Элементы.ВидОрганизационногоОбъекта.Видимость = Ложь;
		Элементы.ВидТехническогоМеста.Видимость = Истина;
	ИначеЕсли Объект.ВидОбъектаСтруктуры = Перечисления.урскВидыОбъектовСтруктуры.ТехническоеМесто Тогда 
		ЭтаФорма.Заголовок = "Техническое место";
		Элементы.ВидОрганизационногоОбъекта.Видимость =  Ложь;
		Элементы.ВидТехническогоМеста.Видимость = Истина ;
	КонецЕсли;

КонецПроцедуры


&НаКлиенте
Процедура ВидОбъектаСтруктурыПриИзменении(Элемент)
	ВидОбъектаСтруктурыПриИзмененииНаСервере();
КонецПроцедуры
